app/views/api/v1/users/index.json.jbuilder


		json.users users.each do |user|
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC

 		json.mobile user.mobile
		json.reward_count user.rewards.count
---
SELECT COUNT(*) FROM "rewards" WHERE "rewards"."user_id" = $1  [["user_id", 1]]