app/controllers/api/v1/rewards_controller.rb

	def index
		@rewards = Reward.all.order(:id)
---
SELECT "rewards".* FROM "rewards" ORDER BY "rewards"."id" ASC

	def create
   	@reward = Reward.new(reward_params)
    	if @reward.save
---
INSERT INTO "rewards" ("name", "amount", "image", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Meenu"], ["amount", 30], ["image", "image name"], ["user_id", 1], ["created_at", "2019-04-19 11:24:05.061508"], ["updated_at", "2019-04-19 11:24:05.061508"]]