app/controllers/api/v1/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC
---
	def index
		@users = User.all.order(:id)

INSERT INTO "users" ("name", "mobile", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Pritam"], ["mobile", "8959782829"], ["created_at", "2019-04-19 11:07:40.682339"], ["updated_at", "2019-04-19 11:07:40.682339"]]
---
	def create
   	@user = User.new(user_params)
    	if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def rewardlist
    @user = User.find_by(id: params[:id])