app/views/api/v1/rewards/index.json.jbuilder

SELECT "rewards".* FROM "rewards" ORDER BY "rewards"."id" ASC
---

		json.reward rewards.each do |reward|